Repository: inveniosoftware/invenio-oaiserver
Catalog: invenio_oaiserver/translations/*/LC_MESSAGES/messages.po
Languages: ar, de, et, fi, hu, tr

source: Sets
ar: المجموعات
et: Kogumid
fi: Setit
hu: Gyűjtemények
tr: Kümeler

source: Identifier
ar: المعرف
de: Kennung
et: Identifikaator
fi: Tunniste
hu: Azonosító
tr: Tanımlayıcı

source: Identifier of the set.
ar: معرف المجموعة
de: Kennung des Sets.
et: Kogumi identifikaator
fi: Setin tunniste.
hu: Gyűjtemény azonosítója.
tr: Kümenin tanımlayıcısı.

source: Long name
ar: الاسم الكامل
de: Langer Name
et: Pikk nimi
fi: Pitkä nimi
hu: Hosszú név
tr: Tam ad

source: Long name of the set.
ar: الاسم الكامل للمجموعة
de: Langer Name des Sets.
et: Kogumi pikk nimi
fi: Setin pitkä nimi.
hu: Gyűjtemény hosszú neve.
tr: Kümenin tam adı

source: Description
ar: وصف
de: Beschreibung
et: Kirjeldus
fi: Kuvaus
hu: Leírás
tr: Tanım

source: Description of the set.
ar: وصف المجموعة
de: Beschreibung des Sets.
et: Kogumi kirjeldus
fi: Setin kuvaus.
hu: Gyűjtemény leírása.
tr: Kümenin tanımı.

source: Search pattern
ar: نمط بحث
de: Suchmuster
et: Otsingumuster
fi: Haku
hu: Keresési minta
tr: Arama modeli

source: Search pattern to select records
ar: نمط بحث لاختيار تسجيلات
de: Suchmuster zur Auswahl von Einträgen
et: Otsingumuster kirjete valimiseks
fi: Hakulause tietueiden valintaan
hu: Keresési mintázat a rekordok kiválasztásához
tr: Kayıtları seçmek için arama modeli

source: System created
ar: أنشئ النظام
de: System erstellt
et: Süsteem loodud
fi: Järjestelmän luoma
hu: Rendszer által létrehozva
tr: Sistem tarafından oluşturulan

source: System created set
ar: مجموعة إنشاء النظام
de: Vom System erstelltes Set
et: Süsteem lõi komplekti
fi: Järjestelmän luoma setti
hu: Rendszer által létrehozott készlet
tr: Sistem tarafından oluşturulan set

source: Updating spec is not allowed.
ar: لا يُسمح بتحديث المواصفات.
de: Aktualisierung der Spezifikation nicht zulässig.
fi: OAI-setin päivittäminen ei ole sallittua.
hu: A specifikáció frissítése nem engedélyezett.

source: Either documents or (document_search_ids and document_search_indices) must be specified.
ar: يجب تحديد الوثائق أو (document_search_ids و document_search_indices).
de: Entweder müssen Dokumente oder (document_search_ids and document_search_indices) angegeben werden.
fi: Joko documents tai (document_search_ids ja document_search_indices) on määriteltävä.
hu: A dokumentumok vagy a („document_search_ids” és „document_search_indices”) mezők megadása kötelező.

source: metadataPrefix does not exist
ar: metadataPrefix غير موجود
de: metadataPrefix existiert nicht
fi: metadataPrefixiä ei ole olemassa
hu: metadataPrefix nem található

source: This is not a valid OAI-PMH verb:%(verb)s
ar: هذا ليس بـ OAI-PMH verb صالح:%(verb)s
de: Dies ist kein gültiges OAI-PMH-Verb: %(verb)s
fi: Virheellinen OAI-PMH-verbi: %(verb)s
hu: Nem érvényes OAI-PMH művelet:%(verb)s

source: Date "from" must be before "until".
ar: التاريخ "من" يجب أن يكون قبل "حتى".
de: Das Datum "von" muss vor dem Datum "bis" liegen.
fi: Päivän "from" on oltava ennen arvoa "until”.
hu: A kezdési dátumnak meg kell előznie a befejezési dátumot.

source: You have passed too many arguments.
ar: لقد تجاوزت العديد من الحجج.
de: Sie haben zu viele Argumente übergeben.
fi: Parametreja on annettu liikaa.
hu: Túl sok paramétert adott meg.
